{
  "Yazılımcı • Pixel Artist • Minimalist": "Developer • Pixel Artist • Minimalist",
  "Mesajınızı bekliyorum": "Waiting for your message",
  "Hakkımda": "About Me",
  "Gönderilerim": "My Posts",
  "Şiirlerim": "My Poems",
  "Projelerim": "My Projects",
  "Kitaplık": "Library",
  "Yer İmleri": "Bookmarks",
  "Manual mod aktif - İki kere tıklayarak otomatik moda alın": "Manual mode active - Double click to switch to automatic mode",
  "Zamana dayalı otomatik mod etkin": "Time-based automatic mode active",
  "Spotify'da Dinliyorum": "Listening on Spotify",
  "Spotify'da aktif değilim": "Not active on Spotify",
  "Müziği aç": "Open music",
  "Profilime git": "Go to my profile",
  "Öne Çıkan Yetenekler": "Featured Skills",
  "Öne Çıkan Projeler": "Featured Projects",
  "Canlı Demo": "Live Demo",
  "Aralık 2023 - Kasım 2024": "December 2023 - November 2024",
  "hey, Ben Meriç": "hey, I'm Meriç",
  "Web siteyi hala geliştirme aşamasındayım. Bu sebeple bazı hatalarla karşılaşabilirsiniz.": "I'm still developing the website. Therefore, you may encounter some errors.",
  "Merhaba, ben bir full-stack geliştiriciyim, aynı zamanda :php geliştiricisi ve :laravel uzmanıyım. Pixel arta olan ilgim ve şiirle olan tutkumun yanı sıra felsefi düşüncelere de büyük bir ilgi duyuyorum. Geçmişte full-stack geliştirici ve takım lideri olarak rol aldım.": "Hello, I'm a full-stack developer, as well as a :php developer and :laravel expert. Besides my interest in pixel art and passion for poetry, I also have a great interest in philosophical thoughts. In the past, I have served as a full-stack developer and team leader.",
  "Göç etmeyi görev edinmiş bir ailenin ferdiyim. İçimdeki asabiyet, bilgiye olan açlığımı kodlamayla giderme yolunda ilerlememe sebep oldu. İlk başlarda zoraki kitap okuma çabalarını hayatımın merkezine alıp uzun süreli bir ilişkiye dönüştürdüm. Bu ilişki, benim için keşfetmenin, üretmenin ve kendimi ifade etmenin bir aracı haline geldi.": "I am a member of a family that has made migration their mission. The restlessness within me led me to progress on the path of satisfying my hunger for knowledge through coding. Initially, I turned my forced book reading efforts into the center of my life and transformed them into a long-term relationship. This relationship became a tool for me to discover, produce, and express myself.",
  "Kitaplarla geçen zamanın ardından, hayal gücümü beslemek ve enerjimi yönlendirmek adına bilgisayar başına geçtim. İnternetin sunduğu oyunlarla tanıştım ve bir süre sonra yazılım dünyasına adım attım. Başlangıçta oyun hileleriyle uğraşırken, hedeflerimi daha büyük düşünmeye başladım. Web geliştirme ve ardından yazılım dilleriyle tanıştım.": "After the time spent with books, I sat at the computer to nourish my imagination and direct my energy. I got acquainted with the games offered by the internet and after a while, I stepped into the software world. While initially dealing with game cheats, I started to think bigger about my goals. I got acquainted with web development and then programming languages.",
  "Şu an, felsefe, edebiyat ve yazılım dünyasında kendimi geliştiriyorum. En büyük amacım, hayattan zevk alırken üretkenliğimi kullanarak başarıya ulaşmak. Günlerim genellikle pixel art ve yazılım çalışmalarıyla geçiyor. Ayrıca, sürekli öğrenme ve kendimi geliştirme amacıyla çeşitli teknolojilere ve çatılara yöneliyorum. Öğrenmek ve pratiğe dökmek benim hayatımın hiç kopamayacak bir parçası.": "Currently, I am developing myself in the world of philosophy, literature, and software. My biggest goal is to achieve success by using my productivity while enjoying life. My days usually pass with pixel art and software work. Additionally, I turn to various technologies and frameworks with the aim of continuous learning and self-improvement. Learning and putting it into practice is an inseparable part of my life.",
  "Çocukluğumdan beri içerik üretmeyi ve içerik tüketmeyi bir hayli seviyorum.": "I have loved creating and consuming content since childhood.",
  "Bağlantılar": "Links",
  "İş Deneyimi": "Work Experience",
  "Mayıs 2025": "May 2025",
  "Ağırlıklı olarak Front-end olmak üzere, laravel ekosistemine uygun react/blade ve blade + alpine arayüzleri geliştiriyorum.": "I primarily develop front-end interfaces compatible with the Laravel ecosystem using React/Blade and Blade + Alpine.",
  "Bu pozisyonda Laravel framework'ü üzerinde kapsamlı tema sistemleri geliştirdim ve Tailwind CSS ile Livewire teknolojilerini entegre ederek modern, dinamik web uygulamaları oluşturdum. Proje yönetimi süreçlerinde product manager ile yakın işbirliği içinde çalışarak, geliştirici ekibinin teknik liderliğini üstlendim.": "In this position, I developed comprehensive theme systems on the Laravel framework and created modern, dynamic web applications by integrating Tailwind CSS and Livewire technologies. I worked closely with the product manager in project management processes and assumed technical leadership of the development team.",
  "PHP üzerinde Kendi View-Controller-Model Yapısını kurma şansım oldu. ReflectionClass ile Controller yapısını gerçekleştirdim. View için ise Twig ve OOP'den yararlandım, Sınıfları genellikle composer ile otomatik olarak yükledim. Bazı zamanlar PHP üzerine eklemeler yapmam gerekti, IMAP, REDIS gibi eklentileri kurdum. Zaten pekte uzak olmadığım SOLID, KISS prensiplerini kullandım. Kodların okunabilirliği ve geriye dönük düzenlemeler için PHPDoc'tan vazgeçmedim. Çoğu zaman işin kısalığından dolayı manuel olarak kod kontrolü gerçekleştirsemde PHPUnit Test kütüphanesini genel olarak öğrendim ve bir kaç işimde ve projelerde kullandım.": "I had the chance to build my own View-Controller-Model structure in PHP. I implemented the Controller structure with ReflectionClass. For the View, I used Twig and OOP, usually loading classes automatically with composer. Sometimes I had to add extensions to PHP, installing plugins like IMAP and REDIS. I used SOLID and KISS principles, which I was already familiar with. I never gave up on PHPDoc for code readability and backward edits. Although I usually performed manual code control due to the brevity of the work, I learned the PHPUnit Test library in general and used it in a few of my jobs and projects.",
  "Bir şirketin tam olarak nasıl sorunsuz bir şekilde işlemesi için gereken donanımları, çalışanların isimleriyle LDAP ağına nasıl bağlı olduklarını ve bu ağa nasıl giriş yaptıklarını, kayıtlarını nasıl oluşturduğumuzu tecrübe ettim. Bunun yanı sıra Bilgisayar Donanımlarıyla ilişkimi kuvvetlendirerek cihazların yanıtlarına göre hangi donanımın sıkıntılı olduğunu çözebilecek konuma geldim. Bir IT Çalışanının rutin olarak neleri kontrol ettiğini ve problemleri hangi prensipler ile çözdüklerini, görev yönetimini nasıl gerçekleştirdiklerini ve gelişimi nasıl takip ettiklerini öğrendim.": "I experienced the hardware required for a company to function smoothly, how employees are connected to the LDAP network with their names, how they log into this network, and how we create their records. In addition, I strengthened my relationship with Computer Hardware and reached a position where I could solve which hardware was problematic according to the responses of the devices. I learned what an IT Employee routinely checks and the principles by which they solve problems, how they perform task management, and how they track development.",
  "Tüm Gönderiler": "All Posts",
  "Fotoğraflar": "Photos",
  "Çizimler": "Drawings",
  "Bu Kategoride Henüz Gönderi Yok": "No Posts in This Category Yet",
  "Bu konu hakkında yazacaklarım olduğunda tekrar uğrayın.": "Come back when I have something to write about this topic.",
  "Düşüncelerim, tecrübelerim ve ara sıra karaladığım çizimler. Burada da çok profesyonel şeyler paylaşmadığımı ve daha kişisel şeyler olduğunu itiraf etmeliyim.": "My thoughts, experiences, and occasionally scribbled drawings. I must admit that I don't share very professional things here either, and they are more personal.",
  "Henüz Gönderi Yok": "No Posts Yet",
  "Burada paylaşacak bir şeyler olduğunda tekrar uğrayın.": "Come back when I have something to share here.",
  " Gönderileri": " Posts",
  " türündeki tüm gönderilerim.": " all my posts of this type.",
  "Bu Türde Henüz Gönderi Yok": "No Posts of This Type Yet",
  "Bu alanda paylaşım yaptığımda tekrar kontrol edin.": "Check back when I share something in this area.",
  "İlham veren, yol gösteren ve ufkumu genişleten dijital duraklarım. Burada seninde hoşuna gidecek şeyler bulabilirsin.": "My digital stops that inspire, guide, and broaden my horizons. You can find things you'll like here too.",
  "Henüz Yer İmi Eklenmemiş": "No Bookmarks Added Yet",
  "Keşfettiğim faydalı bağlantıları burada paylaşacağım.": "I will share the useful links I discover here.",
  "Dijital Kitaplığım": "My Digital Library",
  "Müzik zevkim, kod dünyam ve okuma notlarım. Hepsi bir arada. Umarım hoşuna gidecek şeyler bulabilirsin.": "My musical taste, coding world, and reading notes. All in one place. I hope you can find things you'll like.",
  "Playlistler": "Playlists",
  "Repolar": "Repositories",
  "Gistler": "Gists",
  "Kitaplar": "Books",
  "Kalemimden Dökülenler": "From My Pen",
  "Duygularımı ve düşüncelerimi mısralara döktüğüm kişisel köşem. Küçük bir uyarı, şiirlerin hiç birini bir estetik kaygısı ile yazmadım.": "My personal corner where I pour my emotions and thoughts into verses. A small warning, I didn't write any of the poems with an aesthetic concern.",
  "Devamını Oku": "Read More",
  "Henüz şiir bulunmuyor": "No poems found yet",
  "Yakında burada şiirlerimi görebileceksiniz.": "You will be able to see my poems here soon.",
  "Ana Sayfa": "Home",
  "Şiirler": "Poems",
  " tarihinde yazıldı.": " was written on.",
  "Bu şiiri okurken keyif aldınız mı?": "Did you enjoy reading this poem?",
  "Tüm Şiirler": "All Poems",
  "Geliştirdiğim, katkıda bulunduğum ve gurur duyduğum çalışmalarım.": "My works that I have developed, contributed to, and am proud of.",
  "Öne Çıkanlar": "Featured",
  "Diğer Projeler": "Other Projects",
  "Henüz Proje Eklenmemiş": "No Projects Added Yet",
  "Yakında burada projelerimi görebileceksiniz.": "You will be able to see my projects here soon."
}
