{
  "Yazılımcı • Pixel Artist • Herbokolok": "Developer • Pixel Artist • Know-it-all",
  "Mesajınızı bekliyorum": "Waiting for your message",
  "Hakkımda": "About Me",
  "Gönderilerim": "My Posts",
  "Şiirlerim": "My Poems",
  "Projelerim": "My Projects",
  "Kitaplık": "Library",
  "Yer İmleri": "Bookmarks",
  "Manual mod aktif - İki kere tıklayarak otomatik moda alın": "Manual mode active - Double click to switch to automatic mode",
  "Zamana dayalı otomatik mod etkin": "Time-based automatic mode active",
  "Spotify'da Dinliyorum": "Listening on Spotify",
  "Spotify'da aktif değilim": "Not active on Spotify",
  "Müziği aç": "Open music",
  "Profilime git": "Go to my profile",
  "Öne Çıkan Yetenekler": "Featured Skills",
  "Öne Çıkan Projeler": "Featured Projects",
  "Canlı Demo": "Live Demo",
  "Aralık 2023 - Kasım 2024": "December 2023 - November 2024",
  "hey, Ben Meriç": "hey, I'm Meriç",
  "Web siteyi hala geliştirme aşamasındayım. Bu sebeple bazı hatalarla karşılaşabilirsiniz.": "I'm still developing the website. Therefore, you may encounter some errors.",
  "Merhaba, ben bir full-stack geliştiriciyim, aynı zamanda :php geliştiricisi ve :laravel uzmanıyım. Pixel arta olan ilgim ve şiirle olan tutkumun yanı sıra felsefi düşüncelere de büyük bir ilgi duyuyorum. Geçmişte full-stack geliştirici ve takım lideri olarak rol aldım.": "Hello, I'm a full-stack developer, as well as a :php developer and :laravel expert. Besides my interest in pixel art and passion for poetry, I also have a great interest in philosophical thoughts. In the past, I have served as a full-stack developer and team leader.",
  "Göç etmeyi görev edinmiş bir ailenin ferdiyim. İçimdeki asabiyet, bilgiye olan açlığımı kodlamayla giderme yolunda ilerlememe sebep oldu. İlk başlarda zoraki kitap okuma çabalarını hayatımın merkezine alıp uzun süreli bir ilişkiye dönüştürdüm. Bu ilişki, benim için keşfetmenin, üretmenin ve kendimi ifade etmenin bir aracı haline geldi.": "I am a member of a family that has made migration their mission. The restlessness within me led me to progress on the path of satisfying my hunger for knowledge through coding. Initially, I turned my forced book reading efforts into the center of my life and transformed them into a long-term relationship. This relationship became a tool for me to discover, produce, and express myself.",
  "Kitaplarla geçen zamanın ardından, hayal gücümü beslemek ve enerjimi yönlendirmek adına bilgisayar başına geçtim. İnternetin sunduğu oyunlarla tanıştım ve bir süre sonra yazılım dünyasına adım attım. Başlangıçta oyun hileleriyle uğraşırken, hedeflerimi daha büyük düşünmeye başladım. Web geliştirme ve ardından yazılım dilleriyle tanıştım.": "After the time spent with books, I sat at the computer to nourish my imagination and direct my energy. I got acquainted with the games offered by the internet and after a while, I stepped into the software world. While initially dealing with game cheats, I started to think bigger about my goals. I got acquainted with web development and then programming languages.",
  "Şu an, felsefe, edebiyat ve yazılım dünyasında kendimi geliştiriyorum. En büyük amacım, hayattan zevk alırken üretkenliğimi kullanarak başarıya ulaşmak. Günlerim genellikle pixel art ve yazılım çalışmalarıyla geçiyor. Ayrıca, sürekli öğrenme ve kendimi geliştirme amacıyla çeşitli teknolojilere ve çatılara yöneliyorum. Öğrenmek ve pratiğe dökmek benim hayatımın hiç kopamayacak bir parçası.": "Currently, I am developing myself in the world of philosophy, literature, and software. My biggest goal is to achieve success by using my productivity while enjoying life. My days usually pass with pixel art and software work. Additionally, I turn to various technologies and frameworks with the aim of continuous learning and self-improvement. Learning and putting it into practice is an inseparable part of my life.",
  "Çocukluğumdan beri içerik üretmeyi ve içerik tüketmeyi bir hayli seviyorum.": "I have loved creating and consuming content since childhood."
}